Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: If @var{string-or-char} is a string, this function capitalizes the initials of the words in @var{string-or-char}, without altering any letters other than the initials. It returns a new string whose contents are a copy of @var{string-or-char}, in which each word has had its initial letter converted to upper case.
fr_fr: Si @var{string-or-char} est une chaîne, cette fonction met en majuscule les initiales des mots dans @var{string-or-char}, sans modifier les autres lettres que les initiales. Elle retourne une nouvelle chaîne dont le contenu est une copie de @var{string-or-char}, dans laquelle chaque mot a sa lettre initiale convertie en majuscule.

source: If @var{string} contains more than one format specification, the format specifications correspond to successive values from @var{objects}. Thus, the first format specification in @var{string} uses the first such value, the second format specification uses the second such value, and so on. Any extra format specifications (those for which there are no corresponding values) cause an error. Any extra values to be formatted are ignored.
fr_fr: Si @var{string} contient plus d'une spécification de format, les spécifications de format correspondent aux valeurs successives de @var{objects}. Ainsi, la première spécification de format de @var{string} utilise la première de ces valeurs, la deuxième spécification de format utilise la deuxième de ces valeurs, et ainsi de suite. Toutes les spécifications de format supplémentaires (celles pour lesquelles il n'y pas pas de valeur correspondante) provoquent une erreur. Toutes les valeurs supplémentaires à formater sont ignorées.

source: If @var{weak} is @code{key-and-value} or @code{t}, both the key and the value must be live in order to preserve the association. Thus, the hash table does not protect either keys or values from garbage collection; if either one is collected as garbage, that removes the association.
fr_fr: Si @var{weak} vaut @code{key-and-value} ou @code{t}, la clé et la valeur doivent absolument être référencées pour préserver l'association. Ainsi donc, la table de hachage ne préserve ni les clés ni les valeurs d'une récupération par le ramasse-miettes ; si l'une des deux est ramassée, l'association est supprimée.

source: If @var{weak} is @code{key-or-value}, either the key or the value can preserve the association. Thus, associations are removed from the hash table when both their key and value would be collected as garbage (if not for references from weak hash tables).
fr_fr: Si @var{weak} vaut @code{key-or-value}, ni la clé ni la valeur ne peuvent conserver l'association. Ainsi donc, les associations sont retirées de la table de hachage quand la clé ainsi que la valeur sont récupérées par le ramasse-miettes (si elles ne sont pas référencées dans des tables de hachage faibles).

source: If @var{weak} is @code{value}, then the hash table does not prevent values from being collected as garbage (if they are not referenced anywhere else); if a particular value does get collected, the corresponding association is removed from the hash table.
fr_fr: Si @var{weak} vaut @code{value}, alors la table de hachage n'empêche pas les valeurs d'être détruites par le ramasse-miettes (si elles ne sont référencées nulle part ailleurs) ; si une valeur particulière se fait ramasser, l'association correspondante est retirée de la table de hachage.

source: If all the arguments are integers, then the result is an integer too. This means the result has to be rounded. On most machines, the result is rounded towards zero after each division, but some machines may round differently with negative arguments. This is because the Lisp function @code{/} is implemented using the C division operator, which also permits machine-dependent rounding. As a practical matter, all known machines round in the standard fashion.
fr_fr: Si tous les arguments sont des nombres entiers, alors le résultat est aussi un nombre entier. Ceci signifie que le résultat doit être arrondi. Sur la plupart des machines, le résultat est arrondi vers le zéro après chaque division, mais quelques machines peuvent arrondir différemment les arguments négatifs. C'est parce que la fonction de Lisp @code{/} est implémentée en utilisant l'opérateur de division de C qui permet l'arrondi en fonction de la machine. Du côté pratique, toutes les machines connues arrondissent en mode standard.

source: If the characters copied from @var{string} have text properties, the properties are copied into the new string also. @xref{Text Properties}.
fr_fr: Si les caractères copiés depuis @var{string} possèdent des propriétés textuelles, les propriétés sont également copiées dans la nouvelle chaîne. Voir la section @xref{Text Properties}.

source: If the object is a string, its text properties are copied into the output. The text properties of the @samp{%s} itself are also copied, but those of the object take priority.
fr_fr: Si l'objet est une chaîne, ces propriétés textuelles sont copiées dans la sortie. Les propriétés textuelles des @samp{%s} eux-mêmes sont aussi copiées, mais celles de l'objet sont prioritaires.

source: If the sequence is a string with text properties, the property list in the copy is itself a copy, not shared with the original's property list. However, the actual values of the properties are shared. @xref{Text Properties}.
fr_fr: Si la suite est une chaîne de caractères avec des propriétés, alors la liste de propriétés de la suite copiée est elle-même une copie. Elle n'est pas partagée avec la liste de propriétés de la suite d'origine. Cependant, les valeurs des propriétés, quant à elles, sont partagées entre les deux listes de propriétés. @xref{Text Properties}.

source: If the specified portions of the two strings match, the value is @code{t}. Otherwise, the value is an integer which indicates how many leading characters agree, and which string is less. Its absolute value is one plus the number of characters that agree at the beginning of the two strings. The sign is negative if @var{string1} (or its specified portion) is less.
fr_fr: Si les parties spécifiées des deux chaînes correspondent, la valeur est @code{t}. Sinon, la valeur est un entier qui indique combien de caractères prépondérants sont en accord, et quelle chaîne est moindre. Sa valeur absolue est un à quoi on ajoute le nombre de caractères qui correspondent au début des deux chaînes. Le signe est négatif si @var{string1} (ou sa partie spécifique) est moindre.

source: If the two objects are not equal, the values returned by @code{sxhash} are usually different, but not always; once in a rare while, by luck, you will encounter two distinct-looking objects that give the same result from @code{sxhash}.
fr_fr: Si les deux objets ne sont pas égaux, d'habitude les valeurs retournées par @code{sxhash} sont différentes, mais pas toujours. Parfois, mais très rarement, par chance, vous rencontrerez deux objets apparemment distincts mais dont le résultat de @code{sxhash} est identique.

source: If the width is too small, @code{format} does not truncate the object's printed representation. Thus, you can use a width to specify a minimum spacing between columns with no risk of losing information.
fr_fr: Si la largeur est trop petite, @code{format} ne tronque pas la représentation affichée de l'objet . Ainsi donc, on peut utiliser une largeur pour spécifier un espace minimum entre les colonnes sans risque de perdre d'information.

source: If this function is called more than once for the same @var{tabname}, subsequent calls add the definitions in @var{definitions} to @var{tabname}, rather than overriding the entire original contents. (A subsequent call only overrides abbrevs explicitly redefined or undefined in @var{definitions}.)
fr_fr: Si cette fonction est appelée plus d'une fois pour le même @var{tabname}, les appels suivants ajoutent les définitions dans @var{definitions} à @var{tabname}, plutôt que de modifier en entier le contenu original. (Un appel suivant modifie seulement des abréviations explicitement redéfinies ou éliminées dans @var{definitions}.)

source: If two objects @var{obj1} and @var{obj2} are equal, then @code{(sxhash @var{obj1})} and @code{(sxhash @var{obj2})} are the same integer.
fr_fr: Si deux objets @var{obj1} et @var{obj2} sont égaux, alors @code{(sxhash @var{obj1})} et @code{(sxhash @var{obj2})} sont le même entier relatif.

source: If you divide an integer by 0, an @code{arith-error} error is signaled. (@xref{Errors}.) Floating point division by zero returns either infinity or a NaN if your machine supports @acronym{IEEE} floating point; otherwise, it signals an @code{arith-error} error.
fr_fr: Si vous divisez un nombre entier par 0, une erreur @code{arith-error} est signalée. (@xref{Errors}.) La division d'un nombre à virgule flottante par zéro renvoie l'un ou l'autre infini ou NaN si votre machine supporte les nombres à virgule flottante @acronym{IEEE}; autrement, elle signale une erreur @code{arith-error}.

source: If you want random numbers that don't always come out the same, execute @code{(random t)}. This chooses a new seed based on the current time of day and on Emacs's process @acronym{ID} number.
fr_fr: Si vous voulez des nombres aléatoires qui ne sont pas toujours pareils, exécuter @code{(random t)}. Ceci choisit une nouvelle graine basée sur l'heure courante du jour et sur le numéro du processus @acronym{ID} d'Emacs.

source: If you want to increment the variable, you must use @code{setq}, like this:
fr_fr: Si vous voulez incrémenter la variable, vous devez employer @code{setq}, comme ceci :

source: Immediately after the @samp{%} and before the optional width and precision, you can put certain ``flag'' characters.
fr_fr: Immédiatement après le @samp{%} et avant les largeur et précision optionnelles, on peut utiliser mettre un caractère "indicateur''.

source: In 29-bit binary, the decimal integer 5 looks like this:
fr_fr: En 29-bit binaire, le nombre entier décimal 5 ressemble à ceci:

source: In Emacs Lisp, @code{nil} and @code{t} are special symbols that always evaluate to themselves. This is so that you do not need to quote them to use them as constants in a program. An attempt to change their values results in a @code{setting-constant} error. @xref{Constant Variables}.
fr_fr: En Emacs Lisp, @code{nil} et @code{t} sont des symboles spéciaux qui s'évaluent toujours eux-mêmes. De sorte que vous n'avez pas besoin de les citer pour les employer comme constantes dans un programme. Une tentative de changer leurs valeurs a comme conséquence une erreur @code{setting-constant}. @xref{Constant Variables}.

source: In Emacs Lisp, a @dfn{sequence} is either a list or an array. The common property of all sequences is that they are ordered collections of elements. This section describes functions that accept any kind of sequence.
fr_fr: .En Lisp Emacs, une suite (@dfn{sequence}) est soit une liste, soit un tableau. La propriété commune de toutes les suites est qu'elles sont des ensembles ordonnés d'éléments. Dans cette partie, on décrit des fonctions qui acceptent tout type de suite.

source: In Emacs Lisp, the indices of the elements of a vector start from zero and count up from there.
fr_fr: Dans Lisp Emacs, les indices des éléments d'un vecteur commencent à zéro et le comptage se fait à partir de là.

source: In Emacs versions before 21, the @code{vconcat} function allowed integers as arguments, converting them to strings of digits, but that feature has been eliminated. The proper way to convert an integer to a decimal number in this way is with @code{format} (@pxref{Formatting Strings}) or @code{number-to-string} (@pxref{String Conversion}).
fr_fr: Dans les versions d'Emacs antérieures à la 21, la fonction @code{vconcat} autorisait des arguments de type entiers en les convertissant en chaîne de caractères contenant des chiffres. Cependant, cette fonctionnalité a été retirée. La méthode correcte pour convertir un nombre entier en nombre décimal de cette façon est d'utiliser la fonction @code{format} (@pxref{Formatting Strings}) or @code{number-to-string} (@pxref{String Conversion}).

source: In Emacs versions before 21, when an argument was an integer (not a sequence of integers), it was converted to a string of digits making up the decimal printed representation of the integer. This obsolete usage no longer works. The proper way to convert an integer to its decimal printed form is with @code{format} (@pxref{Formatting Strings}) or @code{number-to-string} (@pxref{String Conversion}).
fr_fr: Dans les versions inférieures à 21 d'Emacs, quand un argument était un entier (pas une suite d'entiers), il était converti en une chaîne de chiffres qui composaient le nombre décimal s'affichant pour représenter l'entier. Cette pratique obsolète ne fonctionne plus. La bonne façon de convertir un nombre entier dans sa forme décimale affichée est de le faire avec @code{format} (voir la section @pxref{Formatting Strings}) ou avec @code{number-to-string} (voir la section @pxref{Conversion of Characters and Strings}).

source: In Emacs, pseudo-random numbers are generated from a ``seed'' number. Starting from any given seed, the @code{random} function always generates the same sequence of numbers. Emacs always starts with the same seed value, so the sequence of values of @code{random} is actually the same in each Emacs run! For example, in one operating system, the first call to @code{(random)} after you start Emacs always returns @minus{}1457731, and the second one always returns @minus{}7692030. This repeatability is helpful for debugging.
fr_fr: Dans Emacs, des nombres pseudo-aléatoires sont produits à partir de « graine » de nombre. À partir de n'importe quelle graine donnée, la fonction @code{random} produit toujours le même ordre de nombres. Emacs démarre toujours par la même valeur de graine, ainsi la séquence des valeurs de @code{random} est réellement les mêmes dans chaque passe d'Emacs ! Par exemple, dans un logiciel d'exploitation, le premier appel à @code{(random)}, après que vous démarriez Emacs, retourne toujours @minus{}1457731, et le second renvoie toujours @minus{}7692030. Cette répétition est utile pour la correction.

source: In Lisp, the symbol @code{nil} has three separate meanings: it is a symbol with the name @samp{nil}; it is the logical truth value @var{false}; and it is the empty list---the list of zero elements. When used as a variable, @code{nil} always has the value @code{nil}.
fr_fr: En Lisp, le symbole @code{nil} a trois significations distinctes : il est un symbole nommé @samp{nil} ; c'est la vraie valeur logique @var{false} ; et c'est la liste vide---la liste de zéro élément. Une fois utilisé comme variable, @code{nil} a toujours la valeur @code{nil}.

source: In a computer, an integer is represented as a binary number, a sequence of @dfn{bits} (digits which are either zero or one). A bitwise operation acts on the individual bits of such a sequence. For example, @dfn{shifting} moves the whole sequence left or right one or more places, reproducing the same pattern ``moved over.''
fr_fr: Dans un ordinateur, un nombre entier est représenté comme nombre binaire, une séquence de @dfn{bits} (des chiffres qui sont zéro ou un). Une opération de bits agit sur les bits individuels d'une telle séquence. Par exemple, le @dfn{shifting} déplace l'ordre entier à gauche ou à droite d'une ou plusieures places, pour reproduire le même modèle « moved over. »

source: In a function description, the name of the function being described appears first. It is followed on the same line by a list of argument names. These names are also used in the body of the description, to stand for the values of the arguments.
fr_fr: Dans une description de fonction, le nom de la fonction étant décrite apparaît d'abord. Il est suivi sur la même ligne d'une liste de noms d'argument. Ces noms sont également employés dans le corps de la description, pour représenter les valeurs des arguments.

source: In binary, in the 29-bit implementation, the argument looks like this:
fr_fr: En binaire, dans l'exécution de 29 bits, l'argument ressemble à ceci :

source: In contexts where a truth value is expected, any non-@code{nil} value is considered to be @var{true}. However, @code{t} is the preferred way to represent the truth value @var{true}. When you need to choose a value which represents @var{true}, and there is no other basis for choosing, use @code{t}. The symbol @code{t} always has the value @code{t}.
fr_fr: Dans les contextes où une vraie valeur est prévue, n'importe quelle valeur non-@code{nil} est considérée comme @var{true}. Cependant, @code{t} est la manière préférée de représenter la vraie valeur @var{true}. Quand vous devez choisir une valeur qui représente @var{true}, et que vous n'avez aucun autre choix, employer @code{t}. Le symbole @code{t} a toujours la valeur @code{t}.

source: In contrast, shifting the pattern of bits one place to the right with @code{lsh} looks like this:
fr_fr: En revanche, décaler la combinaison de chiffres binaires d'une place vers la droite avec @code{lsh} ressemble à ceci:

source: In principle, if you want an array of text characters, you could use either a string or a vector. In practice, we always choose strings for such applications, for four reasons:
fr_fr: En théorie, si on veut un tableau de caractères de texte, on peut utiliser un tableau type string ou un tableau type vector. En pratique, on choisit toujours des tableaux type string pour de telles applications, pour quatre raisons :

source: In simple cases, all you need to specify is the mapping to lower-case; the three related tables will be calculated automatically from that one.
fr_fr: Dans les cas simples, tout ce qu'on doit spécifier est le mappage pour les minuscules; ces trois tables liées seront calculés automatiquement à partir de ce dernier.

source: In the following three examples, @samp{%7s} specifies a minimum width of 7. In the first case, the string inserted in place of @samp{%7s} has only 3 letters, it needs 4 blank spaces as padding. In the second case, the string @code{"specification"} is 13 letters wide but is not truncated. In the third case, the padding is on the right.
fr_fr: Dans les trois exemples suivants, @samp{%7s} spécifie une largeur minimum de 7. Dans le premier cas, la chaîne insérée à la place de @samp{%7s} a seulement 3 lettres, elle a besoin de 4 espaces vides pour le bourrage. Dans le second cas, la chaîne @code{"specification"} contient 13 lettres mais n'est pas tronquée. Dans le troisième cas, le bourrage est à droite.

source: In this example, the index for @samp{e} is @minus{}3, the index for @samp{f} is @minus{}2, and the index for @samp{g} is @minus{}1. Therefore, @samp{e} and @samp{f} are included, and @samp{g} is excluded.
fr_fr: Dans cet exemple, l’indice de @samp{e} est @minus{}3, l’indice de @samp{f} est @minus{}2, et l’indice de @samp{g} est @minus{}1. Donc, @samp{e} et @samp{f} sont inclus, et @samp{g} est exlcu.

source: In this implementation, the largest 29-bit binary integer value is 268,435,455 in decimal. In binary, it looks like this:
fr_fr: Dans cet exemple, la plus grande valeur de nombre entier binaire de 29 bits est 268 435 455 en décimale. En binaire, elle ressemble à ceci :

source: In this manual, we write @code{()} when we wish to emphasize that it means the empty list, and we write @code{nil} when we wish to emphasize that it means the truth value @var{false}. That is a good convention to use in Lisp programs also.
fr_fr: Dans ce manuel, nous écrivons @code{()} quand nous souhaitons souligner qu'il signifie la liste vide, et nous écrivons @code{nil} quand nous souhaitons souligner qu'il signifie la vraie valeur @var{false}. C'est une bonne convention à employer dans des programmes de Lisp également.

source: In this section, we describe the functions that accept all types of arrays.
fr_fr: Dans cette partie, nous allons décrire les fonctions qui acceptent tout type de tableaux.

source: In this special form, the arguments @var{from} and @var{to} are optional, but must both be present or both absent. If they are present, @var{inc} may optionally be specified as well. These arguments are grouped with the argument @var{var} into a list, to distinguish them from @var{body}, which includes all remaining elements of the form.
fr_fr: Sous ce formulaire spécial, les arguments @var{from} et @var{to} sont facultatif, mais il faut qu'ils soient tous deux présents ou tous deux absents. S'ils sont présents, @var{inc} peut aussi bien être indiqué de manière optionnelle. Ces arguments sont groupés avec l'argument @var{var} dans une liste, pour les distinguer de @var{body}, qui inclut tous les éléments restants de la forme.

source: Integer Basics
fr_fr: Introduction aux entiers

source: Introduction and conventions used.
fr_fr: Introduction et conventions utilisées.

source: It is important to note that in Emacs Lisp, arithmetic functions do not check for overflow. Thus @code{(1+ 268435455)} may evaluate to @minus{}268435456, depending on your hardware.
fr_fr: Il est important de noter qu'en Emacs Lisp, les fonctions arithmétiques ne vérifient pas le débordement. Ainsi @code{(1+ 268435455)} peut être évalué à @minus{}268435456, selon votre matériel.

source: Iteration
fr_fr: Itération

source: Keys which are numbers are ``the same'' if they are @code{equal}, that is, if they are equal in value and either both are integers or both are floating point numbers; otherwise, two distinct objects are never ``the same.''
fr_fr: Les clés qui sont des nombres sont ``les mêmes'' si elles sont @code{equal}, c'est-à-dire si elles sont égales par leurs valeurs et si elles sont l'une et l'autre des entiers (@code{integers}) ou bien des nombres à virgule flottante ; sinon deux objets distincts ne sont jamais ``les mêmes''.

source: Like a buffer, a string can contain text properties for the characters in it, as well as the characters themselves. @xref{Text Properties}. All the Lisp primitives that copy text from strings to buffers or other strings also copy the properties of the characters being copied.
fr_fr: Comme une mémoire tampon, une chaîne peut contenir des propriétés de texte pour les caractères qui s'y trouvent, ainsi que les caractères eux-mêmes. Voir la section @xref{Text Properties}. Toutes les primitives Lips qui copient le texte à partir de chaînes vers la mémoire tampon ou vers d’autres chaînes copient également les propriétés des caractères copiés.

source: Lisp (LISt Processing language) was first developed in the late 1950s at the Massachusetts Institute of Technology for research in artificial intelligence. The great power of the Lisp language makes it ideal for other purposes as well, such as writing editing commands.
fr_fr: Lisp (LISt Processing language) a été développé la première fois vers la fin des années 50 au Massachusetts Institute of Technology pour la recherche en intelligence artificielle. La grande puissance du langage Lisp le rend idéal pour d'autres buts aussi bien, comme l'écriture de commandes d'édition.

source: Lisp Data Types
fr_fr: Types de données Lisp

source: Lisp History
fr_fr: L'histoire de Lisp

source: Lisp history
fr_fr: L'histoire de Lisp

source: List of all error symbols.
fr_fr: Liste de tous les symboles d'erreur

source: Logical and, or, not, shifting.
fr_fr: and, or, not logique et décalage.
